{
  "backend/main.mo": "Motoko actor that stores per-user typing test results in a map and exposes query/update methods for submitting results and retrieving stats like best WPM, average WPM, accuracy, daily streaks, and today's results.",
  "feature_evidence.json": "JSON report mapping feature IDs to their implementing source files, component dependencies, and test IDs, covering navigation, Home, Practice, Learn, and other pages of the CodeType app.",
  "frontend-file-summaries.txt": "JSON object providing one-sentence descriptions of six frontend source files including App.tsx, Test, Progress, Challenges, Profile, and Settings pages.",
  "frontend/index.css": "Global Tailwind CSS stylesheet that defines CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.) used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point titled 'CodeType' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with eight routes (Home, Practice, Learn, Test, Progress, Challenges, Profile, Settings), wraps the app in ThemeProvider and SettingsProvider, and renders the Layout with a Toaster.",
  "frontend/src/components/Layout.tsx": "Layout wrapper that renders the Navigation sidebar and a main content area with appropriate margin/padding offsets for desktop and mobile viewports.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation component that renders a fixed sidebar on desktop and a hamburger-triggered Sheet drawer on mobile, with active-link highlighting and a theme toggle button.",
  "frontend/src/components/TestResults.tsx": "Results overlay component displayed after a typing test completes, showing WPM, accuracy, and duration cards with a grade label, and Save/Try Again buttons that submit results to the backend via a mutation hook.",
  "frontend/src/components/TypingArea.tsx": "Renders a typing test input area with a hidden input capturing keystrokes and a visual display that color-codes each character as correct, incorrect, current, or pending. Respects settings for backspace allowance and font style.",
  "frontend/src/contexts/SettingsContext.tsx": "Provides a React context for user settings (theme, font size, font style, backspace toggle) with localStorage persistence and automatic application of corresponding CSS classes to the document root.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates all dependent queries whenever the actor changes due to identity updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions, identity state, and login status through a React context provider and hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching typing test statistics (WPM, accuracy, streaks, etc.) from the backend actor and a mutation hook for submitting new test results with automatic cache invalidation.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, defines CSS custom properties for light/dark themes with neon accents, and sets up utility classes for font size and font family variants used throughout the app.",
  "frontend/src/lib/utils.ts": "Exports a single `cn` utility function that merges Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/Challenges.tsx": "Renders the Challenges page with daily, weekly, and level-based coding challenges displayed as cards. Includes ChallengeCard and LevelCard components that show difficulty, targets, and navigation to start a challenge.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero section, feature highlights grid, and a contact/feedback form with toast notification on submission.",
  "frontend/src/pages/Learn.tsx": "Educational page presenting typing tips, common coding mistakes with fixes, and a keyboard shortcuts reference table for VS Code, Terminal, and general use.",
  "frontend/src/pages/Practice.tsx": "Interactive typing practice page where users select a programming language and difficulty, then type a displayed code snippet with real-time WPM, accuracy, and progress tracking.",
  "frontend/src/pages/Profile.tsx": "User profile page displaying an editable display name, avatar, and stats (best WPM, average accuracy, total tests, streak) fetched via React Query hooks, plus a recent test results list.",
  "frontend/src/pages/Progress.tsx": "Displays user typing progress with stat cards (best WPM, average WPM, accuracy, streaks), line/bar charts for the last 20 sessions, and a 70-day streak calendar grid using data from custom query hooks.",
  "frontend/src/pages/Settings.tsx": "Settings page allowing users to configure theme (light/dark), font size, font style, and backspace behavior, using the SettingsContext for state management.",
  "frontend/src/pages/Test.tsx": "Typing test page supporting timed, snippet-based, and custom modes with real-time WPM/accuracy tracking, a countdown timer, and result display via reusable components.",
  "frontend/src/utils/challenges.ts": "Defines static daily, weekly, and level-based typing challenge data with metadata like target WPM, accuracy, language, and reset dates.",
  "frontend/src/utils/codeSnippets.ts": "Provides a library of code snippets across Python, Java, C, HTML, and SQL at easy/medium/hard difficulties, with a utility to retrieve random snippets by language and difficulty.",
  "frontend/src/utils/typingMetrics.ts": "Exports utility functions to calculate WPM (using the 5-chars-per-word standard), accuracy percentage, and format elapsed time as a string.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (using oklch variables), fonts, shadows, border radii, and keyframe animations. Includes plugins for typography, container queries, and animate.",
  "project_state.json": "Project state document describing a coding-focused typing test SPA with pages for Home, Practice, Learn, Test, Progress/Stats, Challenges, Profile, and Settings, along with architectural notes, existing feature definitions, and image requirements."
}